-- -*- M2-comint -*- hash: -644607221

i1 : declareGenerators(ZZ, {a=>{}, b=>{}, c=>{}}); -- degrees in X are empty

i2 : X = cospan(4*a-b,4*b-c,4*c-a)

o2 = cokernel | 0  -1 4  |
              | 4  0  -1 |
              | -1 4  0  |

                              3
o2 : ZZ-module, quotient of ZZ

i3 : A0 = image map(X,,matrix {a+b+c})

o3 = subquotient (| 1 |, | 0  -1 4  |)
                  | 1 |  | 4  0  -1 |
                  | 1 |  | -1 4  0  |

                                 3
o3 : ZZ-module, subquotient of ZZ

i4 : A1 = image map(X,,matrix {a+b+c,9*a})

o4 = subquotient (| 1 0 |, | 0  -1 4  |)
                  | 1 9 |  | 4  0  -1 |
                  | 1 0 |  | -1 4  0  |

                                 3
o4 : ZZ-module, subquotient of ZZ

i5 : W = coker matrix {{3},{6}}

o5 = cokernel | 3 |
              | 6 |

                              2
o5 : ZZ-module, quotient of ZZ

i6 : M = prune covariantExtCouple(W,{A0,A1,X});
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406

i7 : plotPages((-1..2,-1..4,1..3), prune @@ evaluateInDegree, M)
warning: clearing value of symbol e to allow access to subscripted variables based on it
       : debug with expression   debug 3903   or with command line option   --debug 3903
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406
page 1, with differential of degree {1, -1}:
+----++----+----------------+--------------+---+
|q=4 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=3 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=2 ||0   |cokernel | 3 0 ||cokernel | 3 ||0  |
|    ||    |         | 0 3 ||              |   |
+----++----+----------------+--------------+---+
|q=1 ||0   |cokernel | 7 |  |0             |0  |
+----++----+----------------+--------------+---+
|q=0 ||0   |cokernel | 3 0 ||cokernel | 3 ||0  |
|    ||    |         | 0 3 ||              |   |
+----++----+----------------+--------------+---+
|q=-1||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|    ||p=-1|p=0             |p=1           |p=2|
+----++----+----------------+--------------+---+

page 2, with differential of degree {1, -2}:
+----++----+----------------+--------------+---+
|q=4 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=3 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=2 ||0   |cokernel | 3 0 ||cokernel | 3 ||0  |
|    ||    |         | 0 3 ||              |   |
+----++----+----------------+--------------+---+
|q=1 ||0   |cokernel | 7 |  |0             |0  |
+----++----+----------------+--------------+---+
|q=0 ||0   |cokernel | 3 0 ||cokernel | 3 ||0  |
|    ||    |         | 0 3 ||              |   |
+----++----+----------------+--------------+---+
|q=-1||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|    ||p=-1|p=0             |p=1           |p=2|
+----++----+----------------+--------------+---+

page 3, with differential of degree {1, -3}:
+----++----+----------------+--------------+---+
|q=4 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=3 ||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|q=2 ||0   |cokernel | 3 |  |cokernel | 3 ||0  |
+----++----+----------------+--------------+---+
|q=1 ||0   |cokernel | 7 |  |0             |0  |
+----++----+----------------+--------------+---+
|q=0 ||0   |cokernel | 3 0 ||0             |0  |
|    ||    |         | 0 3 ||              |   |
+----++----+----------------+--------------+---+
|q=-1||0   |0               |0             |0  |
+----++----+----------------+--------------+---+
|    ||p=-1|p=0             |p=1           |p=2|
+----++----+----------------+--------------+---+


i8 : prune coker(map(ZZ/3,ZZ) ** (presentation X))

      ZZ 1
o8 = (--)
       3

     ZZ
o8 : ---module, free
      3

i9 : E1 = prune pageModule(1, D, M)

o9 = cokernel {0, 0} | 3 0 0 0 0 D_1 0   0   0   0 0   0 0   0   |
              {0, 0} | 0 3 0 0 0 0   D_1 0   0   0 0   0 0   0   |
              {0, 1} | 0 0 7 0 0 0   0   D_1 0   0 0   0 0   0   |
              {0, 2} | 0 0 0 3 0 0   0   0   D_1 0 0   0 0   0   |
              {1, 0} | 0 0 0 0 0 0   0   0   0   3 0   0 D_1 0   |
              {0, 2} | 0 0 0 0 3 0   0   0   0   0 D_1 0 0   0   |
              {1, 2} | 0 0 0 0 0 0   0   0   0   0 0   3 0   D_1 |

     ZZ[D ]                     /ZZ[D ]\
         1                      |    1 |7
o9 : -------module, quotient of |------|
        2                       |   2  |
       D                        |  D   |
        1                       \   1  /

i10 : E2 = prune pageModule(2, D, M)

o10 = cokernel {0, 2} | 3 0 0 0 0 0   0   0   0   0 0   |
               {0, 0} | 0 3 0 0 0 D_2 0   0   0   0 0   |
               {0, 0} | 0 0 3 0 0 0   D_2 0   0   0 0   |
               {0, 1} | 0 0 0 7 0 0   0   D_2 0   0 0   |
               {0, 2} | 0 0 0 0 3 0   0   0   D_2 0 0   |
               {1, 2} | 0 0 0 0 0 0   0   0   0   3 D_2 |

      ZZ[D ]                     /ZZ[D ]\
          2                      |    2 |6
o10 : -------module, quotient of |------|
         2                       |   2  |
        D                        |  D   |
         2                       \   2  /

i11 : E3 = prune pageModule(3, D, M)

o11 = cokernel {0, 0} | 3 0 0 0 D_3 0   0   0   0 0   |
               {0, 0} | 0 3 0 0 0   D_3 0   0   0 0   |
               {0, 1} | 0 0 7 0 0   0   D_3 0   0 0   |
               {0, 2} | 0 0 0 3 0   0   0   D_3 0 0   |
               {1, 2} | 0 0 0 0 0   0   0   0   3 D_3 |

      ZZ[D ]                     /ZZ[D ]\
          3                      |    3 |5
o11 : -------module, quotient of |------|
         2                       |   2  |
        D                        |  D   |
         3                       \   3  /

i12 : prune structureMap({0,2},{1,0},D_2,E2)

o12 = | 1 0 |

o12 : Matrix

i13 : 
