-- -*- M2-comint -*- hash: 213756310

i1 : R = QQ[z]; S = R[g][t]; declareGenerators(S,{a=>{0,0,3},x=>{1,0,1},b=>{0,1,2},y=>{1,1,0}});

i4 : M = cospan(z^13*a,z^15*x,z^6*b,z^8*y,g*a-z*b,g*x-z*y,t*a-z^2*x,t*b-z^2*y); isHomogeneous M

o5 = true

i6 : (dt, dg) = degree \ (S_0, S_1);

i7 : {A,X,B,Y} = (deg -> prune eid({deg#1},eid({deg#0},M))) \ ({0,0},dt,dg,dt+dg);

i8 : netList {{A, X}, {B, Y}}

     +--------------------+--------------------+
o8 = |cokernel {3} | z13 ||cokernel {1} | z15 ||
     +--------------------+--------------------+
     |cokernel {2} | z6 | |cokernel | z8 |     |
     +--------------------+--------------------+

i9 : W = R^1 / (R_0^10);

i10 : W' = extensionInDegree({0}, coefficientRing S, W)

o10 = cokernel | z10 |

                                     1
o10 : R[g]-module, quotient of (R[g])

i11 : couple = prune covariantExtCouple(W',M)
warning: clearing value of symbol t to allow access to subscripted variables based on it
       : debug with expression   debug 5504   or with command line option   --debug 5504

o11 = cokernel {1, 3, 0, -9}  | -g 0  e_1^2 0     -z2 0     -zg 0     z2e_1 zge_1 e_1t_1 0      0   0     0   0     0    0   0      0  0  0   0   0     0  0      0   |
               {1, 3, 1, -10} | z  0  0     e_1^2 0   0     0   0     0     0     0      e_1t_1 0   0     0   0     0    0   0      0  0  0   0   0     0  0      0   |
               {1, 1, 0, -7}  | 0  -g 0     0     t_1 e_1^2 0   0     0     0     0      0      z5g 0     0   0     0    -z8 0      0  0  0   0   0     0  0      0   |
               {1, 1, 1, -8}  | 0  z  0     0     0   0     t_1 e_1^2 0     0     0      0      0   0     0   0     0    0   0      0  0  0   0   0     0  0      0   |
               {-1, 3, 1, 0}  | 0  0  0     0     0   0     0   0     0     0     0      0      0   e_1^2 -z2 0     ze_1 0   e_1t_1 0  0  0   0   0     0  0      0   |
               {-1, 1, 1, 2}  | 0  0  0     0     0   0     0   0     0     0     0      0      0   0     t_1 e_1^2 0    0   0      0  0  0   -z4 0     z6 0      0   |
               {0, 2, 0, 1}   | 0  0  0     0     0   0     0   0     0     0     0      0      0   0     0   0     -g   e_1 0      z2 zg t_1 0   0     0  0      0   |
               {-1, 1, 0, 6}  | 0  0  0     0     0   0     0   0     0     0     0      0      0   0     0   0     0    0   0      0  0  0   g   e_1^2 0  e_1t_1 z10 |

                                                     8
o11 : R[g][e , t ]-module, quotient of (R[g][e , t ])
            1   1                             1   1

i12 : expectExactCouple couple

i13 : excerptCouple({-2,2},4,couple)

o13 =                    .- ->                0                                                                                                                             
               0        (      
                         \     

                                                                                                                            0                                             \ 
                         .- ->                0                       - - ->                       0                      - - ->                       0               - -' 
               0        (                                               0
                         \     

                                                                                                                            0                                             \ 
                         .- -> cokernel {0, -9}  | g  0  z10 | - - - - - - - - - -> cokernel {0, -9}  | g  z2 0  |        - - ->                       0               - -' 
      {0, -9}  | z2 0  |(               {1, -10} | -z z8 0   |   {0, -9}  | 1 0 |            {1, -10} | -z 0  z2 |
      {1, -10} | 0  z2 | \                                       {1, -10} | 0 1 |

                                                                                                                     {0, -7} | 0 z8 |
                                                                                                                     {1, -8} | 0 0  |                                     \ 
                         .- ->  cokernel {1, 0} | -z6 z8 0   |  - - - - - - - - ->   cokernel {1, 0} | -z z2 0  |  - - - - - - - - - -> cokernel {0, -7} | g  0  z10 | - -' 
        {1, 0} | z2 0 | (                {0, 6} | g   0  z10 |    {1, 0} | 1 0 |              {0, 1} | g  0  z2 |                                {1, -8} | -z z6 0   |
        {0, 6} | 0  1 |  \                                        {0, 1} | 0 0 |

                                                                                                                            0                                             \ 
                         .- ->                0                       - - ->                       0                      - - ->        cokernel {1, 2} | -z4 z6 0   | - -' 
               0        (                                               0                                                                        {0, 6} | g   0  z10 |
                         \     

                                                                                                                                                                          \ 
                                                                                                                                                       0               - -' 

i14 : relHom = eid({0,2},couple)

o14 = cokernel {1, 0} | -z z2 0  |
               {0, 1} | g  0  z2 |

                                     2
o14 : R[g]-module, quotient of (R[g])

i15 : (eid({0},relHom), Hom(W,coker map(X,A,{{z^2}})))

o15 = (cokernel {1} | z2 |, cokernel {1} | z2 |)

o15 : Sequence

i16 : (eid({1},relHom), Hom(W,coker map(Y,B,{{z^2}})))

o16 = (cokernel | z2 |, cokernel | z2 |)

o16 : Sequence

i17 : structureMap({0},{1},g,relHom)

o17 = {0} | 0 |
      {1} | 1 |

o17 : Matrix

i18 : erase(symbol x); erase(symbol y);

i20 : n = 2;

i21 : R = QQ[z]; S = (R[g]/g^n)[t]; declareGenerators(S,{x=>{0,0,5},y=>{0,1,0}});

i24 : M = cospan(z^6*x,z^3*t*x,z^10*y,z^7*t*y,g*x-z^5*y,t^2*x,t^2*y); isHomogeneous M

o25 = true

i26 : (dt, dg) = degree \ (S_0, S_1);

i27 : {X,C,Y,D} = (deg -> prune eid({deg#1},eid({deg#0},M))) \ ({0,0},dt,dg,dt+dg);

i28 : netList {{X, C}, {Y, D}}

      +-------------------+-------------------+
o28 = |cokernel {5} | z6 ||cokernel {5} | z3 ||
      +-------------------+-------------------+
      |cokernel | z10 |   |cokernel | z7 |    |
      +-------------------+-------------------+

i29 : Z = R^1 / (R_0^7);

i30 : Z' = extensionInDegree({-n+1}, coefficientRing S, Z)

o30 = cokernel {-1, 0} | z7 |

      R[g]                     /R[g]\1
o30 : -----module, quotient of |----|
        2                      |  2 |
       g                       \ g  /

i31 : couple = prune contravariantExtCouple(M,Z')
warning: clearing value of symbol e to allow access to subscripted variables based on it
       : debug with expression   debug 3903   or with command line option   --debug 3903
warning: clearing value of symbol t to allow access to subscripted variables based on it
       : debug with expression   debug 5504   or with command line option   --debug 5504

o31 = cokernel {1, 1, 0, -11}  | g -z e_1^2 0     0 0  e_1t_1 0      -z3 0     0   0     0  z3e_1 0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {1, 1, -1, -10} | 0 g  0     e_1^2 0 0  0      e_1t_1 0   0     -z3 0     0  0     z3e_1 0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {1, -1, 0, -8}  | 0 0  0     0     g -z 0      0      t_1 e_1^2 0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {1, -1, -1, -7} | 0 0  0     0     0 g  0      0      0   0     t_1 e_1^2 z2 0     0     0     0 0      0     0    z4  0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {1, -1, -2, -5} | 0 0  0     0     0 0  0      0      0   0     0   0     g  0     0     e_1^2 0 e_1t_1 0     0    0   0 0  0      0   0   0     0     0 0  0   z5 0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, 1, 0, -4}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     g 0      e_1^2 ze_1 0   0 0  e_1t_1 0   -z3 0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {0, 0, -1, -3}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     -g   e_1 0 0  0      t_1 0   0     0     0 0  0   0  z3 z2g 0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, -1, 0, -1} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   g -z 0      0   t_1 e_1^2 0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, -1, -1, 0} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 g  0      0   0   0     e_1^2 0 0  -z2 0  0  0   e_1t_1 0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {5, 1, -3, -11} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     g -z 0   0  0  0   0      e_1^2 0     0     0 0  e_1t_1 0      0      0     0     -z3 0   -z3e_1 0     0     0     0  0      0      z7 0  0  0  0  0  |
               {5, 1, -4, -10} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 g  0   0  0  0   0      0     e_1^2 0     0 0  0      e_1t_1 0      0     0     0   -z3 0      0     z3e_1 0     0  0      0      0  z7 0  0  0  0  |
               {-1, -1, -2, 2} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  g   0  0  0   0      0     0     e_1^2 0 0  0      0      e_1t_1 0     0     0   0   0      0     0     0     z5 0      0      0  0  0  0  0  0  |
               {5, -1, -3, -8} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     g -z 0      0      0      e_1^2 0     t_1 0   0      0     0     0     0  0      0      0  0  z7 0  0  0  |
               {5, -1, -4, -7} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 g  0      0      0      0     e_1^2 0   t_1 0      0     0     0     0  0      0      0  0  0  z7 0  0  |
               {5, 1, -4, -8}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     g   z   ge_1   e_1^2 -ze_1 0     0  e_1t_1 0      0  0  0  0  z7 0  |
               {5, 1, -5, -7}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   -g  0      0     ge_1  e_1^2 0  0      e_1t_1 0  0  0  0  0  z7 |

      R[g]                             /R[g]        \16
o31 : ----[e , t ]-module, quotient of |----[e , t ]|
        2   1   1                      |  2   1   1 |
       g                               \ g          /

i32 : excerptCouple({-2,0},4,couple)

o32 =                       .- -> cokernel {-3, -11} | g -z z7 0  0  0  |                                                                                                                       
       {-3, -11} | z3 0  | (               {-4, -10} | 0 g  0  z7 0  0  |
       {-4, -10} | 0  z3 |  \              {-4, -8}  | 0 0  0  0  z7 0  |
       {-4, -8}  | -g -z |                 {-5, -7}  | 0 0  0  0  0  z7 |
       {-5, -7}  | 0  g  |

                                                                                                                                             0                                                \ 
                            .- ->                    0                            - - ->                         0                         - - ->         cokernel {-3, -8} | g -z z7 0  | - -' 
                0          (                                                        0                                                                              {-4, -7} | 0 g  0  z7 |
                            \     

                                                                                                                                             0                                                \ 
                            .- ->   cokernel {0, -11}  | g -z 0  0  0  |  - - - - - - - - - - -> cokernel {0, -11}  | g -z z3 0  |         - - ->                         0                - -' 
      {0, -11}  | z3 0  0 |(                 {-1, -10} | 0 g  z5 z7 0  |   {0, -11}  | 1 0 0 |            {-1, -10} | 0 g  0  z3 |
      {-1, -10} | 0  z3 0 | \                {-2, -5}  | 0 0  g  0  z5 |   {-1, -10} | 0 1 0 |
      {-2, -5}  | 0  0  1 |

                                                                                                                                     {0, -8}  | 0 0   |
                                                                                                                                     {-1, -7} | 0 -z4 |
                                                                                                                                     {-2, -5} | 0 0   |                                       \ 
                            .- ->    cokernel {0, -4} | g -z4 0   0  |    - - - - - - - - - - ->  cokernel {0, -4}  | g -z z3 0  | - - - - - - - - - - -> cokernel {0, -8}  | g -z 0  0  | - -' 
        {0, -4} | z3 0 0 | (                  {-1, 0} | 0 g   -z2 0  |      {0, -4}  | 1 0 0 |             {-1, -3} | 0 g  0  z3 |                                 {-1, -7} | 0 g  z2 0  |
        {-1, 0} | 0  1 0 |  \                 {-2, 2} | 0 0   g   z5 |      {-1, -3} | 0 0 0 |                                                                     {-2, -5} | 0 0  g  z5 |
        {-2, 2} | 0  0 1 |

                                                                                                                                             0                                                \ 
                            .- ->                    0                            - - ->                         0                         - - ->         cokernel {0, -1} | g -z 0   0  | - -' 
                0          (                                                        0                                                                              {-1, 0} | 0 g  -z2 0  |
                            \                                                                                                                                      {-2, 2} | 0 0  g   z5 |

                                                                                                                                                                                              \ 
                                                                                                                                                                          0                - -' 

i33 : C = restackModule({2,1},couple)
warning: clearing value of symbol e to allow access to subscripted variables based on it
       : debug with expression   debug 3903   or with command line option   --debug 3903
warning: clearing value of symbol t to allow access to subscripted variables based on it
       : debug with expression   debug 5504   or with command line option   --debug 5504

o33 = cokernel {0, 1, 1, -11}  | g -z e_1^2 0     0 0  e_1t_1 0      -z3 0     0   0     0  z3e_1 0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, 1, 1, -10} | 0 g  0     e_1^2 0 0  0      e_1t_1 0   0     -z3 0     0  0     z3e_1 0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {0, 1, -1, -8}  | 0 0  0     0     g -z 0      0      t_1 e_1^2 0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, 1, -1, -7} | 0 0  0     0     0 g  0      0      0   0     t_1 e_1^2 z2 0     0     0     0 0      0     0    z4  0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-2, 1, -1, -5} | 0 0  0     0     0 0  0      0      0   0     0   0     g  0     0     e_1^2 0 e_1t_1 0     0    0   0 0  0      0   0   0     0     0 0  0   z5 0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {0, -1, 1, -4}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     g 0      e_1^2 ze_1 0   0 0  e_1t_1 0   -z3 0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, 0, 0, -3}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     -g   e_1 0 0  0      t_1 0   0     0     0 0  0   0  z3 z2g 0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {0, -1, -1, -1} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   g -z 0      0   t_1 e_1^2 0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-1, -1, -1, 0} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 g  0      0   0   0     e_1^2 0 0  -z2 0  0  0   e_1t_1 0     0     0     0 0  0      0      0      0     0     0   0   0      0     0     0     0  0      0      0  0  0  0  0  0  |
               {-3, 5, 1, -11} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     g -z 0   0  0  0   0      e_1^2 0     0     0 0  e_1t_1 0      0      0     0     -z3 0   -z3e_1 0     0     0     0  0      0      z7 0  0  0  0  0  |
               {-4, 5, 1, -10} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 g  0   0  0  0   0      0     e_1^2 0     0 0  0      e_1t_1 0      0     0     0   -z3 0      0     z3e_1 0     0  0      0      0  z7 0  0  0  0  |
               {-2, -1, -1, 2} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  g   0  0  0   0      0     0     e_1^2 0 0  0      0      e_1t_1 0     0     0   0   0      0     0     0     z5 0      0      0  0  0  0  0  0  |
               {-3, 5, -1, -8} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     g -z 0      0      0      e_1^2 0     t_1 0   0      0     0     0     0  0      0      0  0  z7 0  0  0  |
               {-4, 5, -1, -7} | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 g  0      0      0      0     e_1^2 0   t_1 0      0     0     0     0  0      0      0  0  0  z7 0  0  |
               {-4, 5, 1, -8}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     g   z   e_1g   e_1^2 -ze_1 0     0  e_1t_1 0      0  0  0  0  z7 0  |
               {-5, 5, 1, -7}  | 0 0  0     0     0 0  0      0      0   0     0   0     0  0     0     0     0 0      0     0    0   0 0  0      0   0   0     0     0 0  0   0  0  0   0      0     0     0     0 0  0      0      0      0     0     0   -g  0      0     e_1g  e_1^2 0  0      e_1t_1 0  0  0  0  0  z7 |

      R[e , t ][g]                     /R[e , t ][g]\
         1   1                         |   1   1    |16
o33 : -------------module, quotient of |------------|
            2                          |      2     |
           g                           \     g      /

i34 : C0 = evaluateInDegree({0},C)

o34 = cokernel {1, 1, -11}  | -z e_1^2 0     0  e_1t_1 0      -z3 0     0   0     0  z3e_1 0     0     0    0   0  0      0   0   0     0     0   0  0  0      |
               {1, 1, -10}  | 1  0     e_1^2 0  0      e_1t_1 0   0     -z3 0     0  0     z3e_1 0     0    0   0  0      0   0   0     0     0   0  0  0      |
               {1, -1, -8}  | 0  0     0     -z 0      0      t_1 e_1^2 0   0     0  0     0     0     0    0   0  0      0   0   0     0     0   0  0  0      |
               {1, -1, -7}  | 0  0     0     1  0      0      0   0     t_1 e_1^2 z2 0     0     0     0    z4  0  0      0   0   0     0     0   0  0  0      |
               {-1, 1, -4}  | 0  0     0     0  0      0      0   0     0   0     0  0     0     e_1^2 ze_1 0   0  e_1t_1 0   -z3 0     0     0   0  0  0      |
               {0, 0, -3}   | 0  0     0     0  0      0      0   0     0   0     0  0     0     0     -1   e_1 0  0      t_1 0   0     0     0   z3 z2 0      |
               {-1, -1, -1} | 0  0     0     0  0      0      0   0     0   0     0  0     0     0     0    0   -z 0      0   t_1 e_1^2 0     0   0  0  0      |
               {-1, -1, 0}  | 0  0     0     0  0      0      0   0     0   0     0  0     0     0     0    0   1  0      0   0   0     e_1^2 -z2 0  0  e_1t_1 |

                                               8
o34 : R[e , t ]-module, quotient of (R[e , t ])
         1   1                          1   1

i35 : expectExactCouple C0

i36 : C1 = evaluateInDegree({-1},C)

o36 = cokernel {1, 1, -10} | e_1^2 e_1t_1 -z3 0     0  z3e_1 0     0      0   0   0     0 0   0  0  0      0     0 0      0  |
               {1, -1, -7} | 0     0      t_1 e_1^2 z2 0     0     0      z4  0   0     0 0   0  0  0      0     0 0      0  |
               {1, -1, -5} | 0     0      0   0     1  0     e_1^2 e_1t_1 0   0   0     0 0   z5 0  0      0     0 0      0  |
               {0, 0, -3}  | 0     0      0   0     0  0     0     0      e_1 t_1 0     0 0   0  z3 0      0     0 0      0  |
               {-1, -1, 0} | 0     0      0   0     0  0     0     0      0   0   e_1^2 0 -z2 0  0  e_1t_1 0     0 0      0  |
               {-1, -1, 2} | 0     0      0   0     0  0     0     0      0   0   0     0 1   0  0  0      e_1^2 0 e_1t_1 z5 |

                                               6
o36 : R[e , t ]-module, quotient of (R[e , t ])
         1   1                          1   1

i37 : expectExactCouple C1

i38 : excerptCouple({-2,0},4,C0)

o38 =              .- ->           0                                                                                 
            0     (      
                   \     

                                                                                      0                            \ 
                   .- ->           0               - - ->               0           - - ->           0          - -' 
            0     (                                  0
                   \     

                                                                                      0                            \ 
                   .- -> cokernel {-11} | z6 | - - - - - - -> cokernel {-11} | z3 | - - ->           0          - -' 
      {-11} | z3 |(                             {-11} | 1 |
                   \     

                                                                                      0                            \ 
                   .- ->  cokernel {-4} | z6 | - - - - - - ->  cokernel {-4} | z3 | - - -> cokernel {-8} | z3 | - -' 
       {-4} | z3 |(                              {-4} | 1 |
                   \     

                                                                                      0                            \ 
                   .- ->           0               - - ->               0           - - -> cokernel {-1} | z3 | - -' 
            0     (                                  0
                   \     

                                                                                                                   \ 
                                                                                                     0          - -' 

i39 : excerptCouple({-2,0},4,C1)

o39 =              .- ->           0                                                                                           
            0     (      
                   \     

                                                                                           0                                 \ 
                   .- ->           0               - - ->               0                - - ->                0          - -' 
            0     (                                  0
                   \     

                                                                                           0                                 \ 
                   .- -> cokernel {-10} | z7 | - - - - - - -> cokernel {-10} | z3 |      - - ->                0          - -' 
      {-10} | z3 |(                             {-10} | 1 |
                   \     

                                                                                      {-7} | -z4 |                           \ 
                   .- ->    cokernel | z7 |        - - ->      cokernel {-3} | z3 | - - - - - - - -> cokernel {-7} | z7 | - -' 
          | 1 |   (                                  0
                   \     

                                                                                           0                                 \ 
                   .- ->           0               - - ->               0                - - ->         cokernel | z7 |   - -' 
            0     (                                  0
                   \     

                                                                                                                             \ 
                                                                                                               0          - -' 

i40 : A = image map(X,,{{z^3}});

i41 : B = image map(Y,,{{z^7}});

i42 : contravariantExtLES(4,X,A,Z)
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406

o42 =              .- ->           0                                                                                 
            0     (      
                   \     

                                                                                      0                            \ 
                   .- ->           0               - - ->               0           - - ->           0          - -' 
            0     (                                  0
                   \     

                                                                                      0                            \ 
                   .- -> cokernel {-11} | z6 | - - - - - - -> cokernel {-11} | z3 | - - ->           0          - -' 
      {-11} | z3 |(                             {-11} | 1 |
                   \     

                                                                                      0                            \ 
                   .- ->  cokernel {-4} | z6 | - - - - - - ->  cokernel {-4} | z3 | - - -> cokernel {-8} | z3 | - -' 
       {-4} | z3 |(                              {-4} | 1 |
                   \     

                                                                                      0                            \ 
                   .- ->           0               - - ->               0           - - -> cokernel {-1} | z3 | - -' 
            0     (                                  0
                   \     

                                                                                                                   \ 
                                                                                                     0          - -' 

i43 : contravariantExtLES(4,Y,B,Z)
warning: clearing value of symbol e to allow access to subscripted variables based on it
       : debug with expression   debug 3903   or with command line option   --debug 3903
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406

o43 =              .- ->           0                                                                                         
            0     (      
                   \     

                                                                                          0                                \ 
                   .- ->           0               - - ->               0               - - ->               0          - -' 
            0     (                                  0
                   \     

                                                                                          0                                \ 
                   .- -> cokernel {-10} | z7 | - - - - - - -> cokernel {-10} | z3 |     - - ->               0          - -' 
      {-10} | z3 |(                             {-10} | 1 |
                   \     

                                                                                     {-7} | z4 |                           \ 
                   .- ->    cokernel | z7 |        - - ->      cokernel {-3} | z3 | - - - - - - -> cokernel {-7} | z7 | - -' 
          | 1 |   (                                  0
                   \     

                                                                                          0                                \ 
                   .- ->           0               - - ->               0               - - ->        cokernel | z7 |   - -' 
            0     (                                  0
                   \     

                                                                                                                           \ 
                                                                                                             0          - -' 

i44 : 
