-- -*- M2-comint -*- hash: 1105567910

i1 : Q = coupleRing(ZZ,1,e,f,Degrees=>{{-1,0},{2,-2}})

o1 = Q

o1 : PolynomialRing

i2 : declareCouple(Q, {z => {4,0}}, {x => {1,0}, y => {1,2}, w => {5,2}})

o2 = cokernel {5, 2} | e_1^2 e_1f_1 0     0      0     0      0     0   |
              {1, 0} | 0     0      e_1^2 e_1f_1 0     0      0     0   |
              {1, 2} | 0     0      0     0      e_1^2 e_1f_1 0     0   |
              {4, 0} | 0     0      0     0      0     0      e_1^3 f_1 |

                            4
o2 : Q-module, quotient of Q

i3 : C = cospan(e_1*z-f_1*y)

o3 = cokernel {5, 2} | 0    e_1^2 e_1f_1 0     0      0     0      0     0   |
              {1, 0} | 0    0     0      e_1^2 e_1f_1 0     0      0     0   |
              {1, 2} | -f_1 0     0      0     0      e_1^2 e_1f_1 0     0   |
              {4, 0} | e_1  0     0      0     0      0     0      e_1^3 f_1 |

                            4
o3 : Q-module, quotient of Q

i4 : isHomogeneous C

o4 = true

i5 : expectExactCouple C

i6 : plotPages((0..3,0..2,1..3), prune @@ evaluateInDegree, C)
page 1, with differential of degree {-1, 0}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|   ||  1|   |  1|   |
|q=1||ZZ |0  |ZZ |0  |
+---++---+---+---+---+
|   ||  1|   |  1|   |
|q=0||ZZ |0  |ZZ |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+

page 2, with differential of degree {-2, 1}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|   ||  1|   |  1|   |
|q=1||ZZ |0  |ZZ |0  |
+---++---+---+---+---+
|   ||  1|   |  1|   |
|q=0||ZZ |0  |ZZ |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+

page 3, with differential of degree {-3, 2}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|   ||   |   |  1|   |
|q=1||0  |0  |ZZ |0  |
+---++---+---+---+---+
|   ||  1|   |   |   |
|q=0||ZZ |0  |0  |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+


i7 : plotPages((0..3,0..2,10), prune @@ evaluateInDegree, C)
page 10, with differential of degree {-10, 9}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|   ||   |   |  1|   |
|q=1||0  |0  |ZZ |0  |
+---++---+---+---+---+
|   ||  1|   |   |   |
|q=0||ZZ |0  |0  |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+


i8 : plotPages((0..3,0..2,1..3), hilbertFunction, C)
page 1, with differential of degree {-1, 0}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|q=1||1  |0  |1  |0  |
+---++---+---+---+---+
|q=0||1  |0  |1  |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+

page 2, with differential of degree {-2, 1}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|q=1||1  |0  |1  |0  |
+---++---+---+---+---+
|q=0||1  |0  |1  |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+

page 3, with differential of degree {-3, 2}:
+---++---+---+---+---+
|q=2||0  |0  |0  |0  |
+---++---+---+---+---+
|q=1||0  |0  |1  |0  |
+---++---+---+---+---+
|q=0||1  |0  |0  |0  |
+---++---+---+---+---+
|   ||p=0|p=1|p=2|p=3|
+---++---+---+---+---+


i9 : 
