-- -*- M2-comint -*- hash: 808027446

i1 : R = QQ[x,y,z];

i2 : p = y^2*z-x^3+17*z^3;

i3 : filt = {module ideal(p^2), module ideal(p), R^1};

i4 : k = max({0} | apply(filt,regularity));

i5 : W = module ideal(x^k,y^k,z^k);

i6 : couple = prune covariantExtCouple(W, filt)
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406

o6 = cokernel {3, 5, -18} | e_1^2 e_1f_1 x3-y2z-17z3 0     (x3-y2z-17z3)e_1 0           0     0                z6 y6 x6 0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                0           0     0                |
              {3, 3, -15} | 0     0      f_1         e_1^2 0                x3-y2z-17z3 0     (x3-y2z-17z3)e_1 0  0  0  -x3y2-y4z+34x3z2+17y2z3+578z5 z6 y6 x6 0   0                             0  0  0  0           0   -x3z4-y2z5 0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                0           0     0                |
              {3, 1, -12} | 0     0      0           0     0                f_1         e_1^2 0                0  0  0  0                             0  0  0  0   -x3y2-y4z+34x3z2+17y2z3+578z5 z6 y6 x6 0           0   0          0                0           0  0   0   -x3z4-y2z5 0                0   0  0   0   0   0     0      0           0     0                0           0     0                |
              {2, 4, -10} | 0     0      0           0     0                0           0     0                0  0  0  e_1                           0  0  0  f_1 0                             0  0  0  x3-y2z-17z3 0   0          y4+34y2z2+1156z4 0           0  -z4 0   0          0                -z5 0  0   0   0   0     0      0           0     0                0           0     0                |
              {2, 2, -7}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   e_1                           0  0  0  0           f_1 0          0                x3-y2z-17z3 0  0   0   0          y4+34y2z2+1156z4 0   0  -z4 0   -z5 0     0      0           0     0                0           0     0                |
              {2, 4, -8}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   e_1        0                0           z2 y2  f_1 0          0                x3  0  0   0   0   0     0      0           0     0                0           0     0                |
              {2, 2, -5}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   e_1        0                0   z2 y2  f_1 x3  0     0      0           0     0                0           0     0                |
              {-1, 5, 0}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   e_1^2 e_1f_1 x3-y2z-17z3 0     (x3-y2z-17z3)e_1 0           0     0                |
              {-1, 3, 3}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      f_1         e_1^2 0                x3-y2z-17z3 0     (x3-y2z-17z3)e_1 |
              {-1, 1, 6}  | 0     0      0           0     0                0           0     0                0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                f_1         e_1^2 0                |

                                              10
o6 : R[e , f ]-module, quotient of (R[e , f ])
        1   1                          1   1

i7 : prune evaluateInDegree(2*{1,2},couple)

o7 = cokernel {-10} | x3-y2z-17z3 0  z4  y4+34y2z2 0      |
              {-8}  | 0           z2 -y2 1156y2    x3-y2z |

                            2
o7 : R-module, quotient of R

i8 : coupleRestacked = restackModule({2,1},couple)
warning: clearing value of symbol e to allow access to subscripted variables based on it
       : debug with expression   debug 3903   or with command line option   --debug 3903
warning: clearing value of symbol f to allow access to subscripted variables based on it
       : debug with expression   debug 3406   or with command line option   --debug 3406

o8 = cokernel {-18, 3, 5} | e_1^2 e_1f_1 x3-y2z-17z3 0     e_1x3-e_1y2z-17e_1z3 0           0     0                    z6 y6 x6 0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                    0           0     0                    |
              {-15, 3, 3} | 0     0      f_1         e_1^2 0                    x3-y2z-17z3 0     e_1x3-e_1y2z-17e_1z3 0  0  0  -x3y2-y4z+34x3z2+17y2z3+578z5 z6 y6 x6 0   0                             0  0  0  0           0   -x3z4-y2z5 0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                    0           0     0                    |
              {-12, 3, 1} | 0     0      0           0     0                    f_1         e_1^2 0                    0  0  0  0                             0  0  0  0   -x3y2-y4z+34x3z2+17y2z3+578z5 z6 y6 x6 0           0   0          0                0           0  0   0   -x3z4-y2z5 0                0   0  0   0   0   0     0      0           0     0                    0           0     0                    |
              {-10, 2, 4} | 0     0      0           0     0                    0           0     0                    0  0  0  e_1                           0  0  0  f_1 0                             0  0  0  x3-y2z-17z3 0   0          y4+34y2z2+1156z4 0           0  -z4 0   0          0                -z5 0  0   0   0   0     0      0           0     0                    0           0     0                    |
              {-7, 2, 2}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   e_1                           0  0  0  0           f_1 0          0                x3-y2z-17z3 0  0   0   0          y4+34y2z2+1156z4 0   0  -z4 0   -z5 0     0      0           0     0                    0           0     0                    |
              {-8, 2, 4}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   e_1        0                0           z2 y2  f_1 0          0                x3  0  0   0   0   0     0      0           0     0                    0           0     0                    |
              {-5, 2, 2}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   e_1        0                0   z2 y2  f_1 x3  0     0      0           0     0                    0           0     0                    |
              {0, -1, 5}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   e_1^2 e_1f_1 x3-y2z-17z3 0     e_1x3-e_1y2z-17e_1z3 0           0     0                    |
              {3, -1, 3}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      f_1         e_1^2 0                    x3-y2z-17z3 0     e_1x3-e_1y2z-17e_1z3 |
              {6, -1, 1}  | 0     0      0           0     0                    0           0     0                    0  0  0  0                             0  0  0  0   0                             0  0  0  0           0   0          0                0           0  0   0   0          0                0   0  0   0   0   0     0      0           0     0                    f_1         e_1^2 0                    |

                                                                  10
o8 : QQ[e , f ][x, y, z]-module, quotient of (QQ[e , f ][x, y, z])
         1   1                                    1   1

i9 : coupleEvaluated = prune evaluateInDegree({0}, coupleRestacked)

o9 = cokernel {3, 1}  | 0     0      0   0   0   0   0   0   0   0   0   e_1^2 0     0     0     f_1 0     0     0     0     0     0     0   0     |
              {2, 2}  | 0     0      f_1 0   0   0   0   0   0   0   0   0     e_1^3 0     0     0   0     0     0     0     0     0     0   0     |
              {2, 2}  | 0     0      0   f_1 0   0   0   0   0   0   0   0     0     e_1^3 0     0   0     0     0     0     0     0     0   0     |
              {2, 2}  | 0     0      0   0   f_1 0   0   0   0   0   0   0     0     0     e_1^3 0   0     0     0     0     0     0     0   0     |
              {2, 4}  | 0     0      0   0   0   0   0   0   0   0   0   0     0     0     0     e_1 0     0     0     0     0     0     f_1 e_1^2 |
              {2, 2}  | 0     0      0   0   0   f_1 0   0   0   0   0   0     0     0     0     0   e_1^3 0     0     0     0     0     0   0     |
              {2, 2}  | 0     0      0   0   0   0   f_1 0   0   0   0   0     0     0     0     0   0     e_1^3 0     0     0     0     0   0     |
              {2, 2}  | 0     0      0   0   0   0   0   f_1 0   0   0   0     0     0     0     0   0     0     e_1^3 0     0     0     0   0     |
              {2, 2}  | 0     0      0   0   0   0   0   0   f_1 0   0   0     0     0     0     0   0     0     0     e_1^3 0     0     0   0     |
              {2, 2}  | 0     0      0   0   0   0   0   0   0   f_1 0   0     0     0     0     0   0     0     0     0     e_1^3 0     0   0     |
              {2, 2}  | 0     0      0   0   0   0   0   0   0   0   f_1 0     0     0     0     0   0     0     0     0     0     e_1^3 0   0     |
              {-1, 5} | e_1^2 e_1f_1 0   0   0   0   0   0   0   0   0   0     0     0     0     0   0     0     0     0     0     0     0   0     |

                                                12
o9 : QQ[e , f ]-module, quotient of (QQ[e , f ])
         1   1                           1   1

i10 : plotPages((-1..3,-1..3,1..3), prune @@ evaluateInDegree, coupleEvaluated)
page 1, with differential of degree {1, -1}:
+----++----+---+---+----+---+
|q=3 ||0   |0  |0  |0   |0  |
+----++----+---+---+----+---+
|    ||    |  1|  1|    |   |
|q=2 ||0   |QQ |QQ |0   |0  |
+----++----+---+---+----+---+
|    ||    |   |  9|    |   |
|q=1 ||0   |0  |QQ |0   |0  |
+----++----+---+---+----+---+
|    ||    |   |   |  10|   |
|q=0 ||0   |0  |0  |QQ  |0  |
+----++----+---+---+----+---+
|q=-1||0   |0  |0  |0   |0  |
+----++----+---+---+----+---+
|    ||p=-1|p=0|p=1|p=2 |p=3|
+----++----+---+---+----+---+

page 2, with differential of degree {1, -2}:
+----++----+---+---+---+---+
|q=3 ||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|    ||    |  1|  1|   |   |
|q=2 ||0   |QQ |QQ |0  |0  |
+----++----+---+---+---+---+
|q=1 ||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|    ||    |   |   |  1|   |
|q=0 ||0   |0  |0  |QQ |0  |
+----++----+---+---+---+---+
|q=-1||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|    ||p=-1|p=0|p=1|p=2|p=3|
+----++----+---+---+---+---+

page 3, with differential of degree {1, -3}:
+----++----+---+---+---+---+
|q=3 ||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|    ||    |  1|   |   |   |
|q=2 ||0   |QQ |0  |0  |0  |
+----++----+---+---+---+---+
|q=1 ||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|q=0 ||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|q=-1||0   |0  |0  |0  |0  |
+----++----+---+---+---+---+
|    ||p=-1|p=0|p=1|p=2|p=3|
+----++----+---+---+---+---+


i11 : 
